#include <iostream>
#include <bitset>
using namespace std;

int main()
{
    // ----------------------------------------------------------
    // 位与运算符 &         注意： & 运算符优先级极低，低于 = 和 << 等符号，需要加 ()
    // 1. 位运算判断奇偶
    int num = 10086;
    if(num & 1) {
        cout << "奇数" << endl;
    }else {
        cout << "偶数" << endl;
    }

    // 2. 消除末尾连续的 1
    int a =     0b0111101110111111;
    // a + 1 =  0b0111101111000000
    //     a =  0b0111101110111111
    //     & =  0b0111101110000000
    a = a & (a + 1);
    cout << bitset<16>(a) << endl;

    // 3. 2 的幂判定
    int b =    0b01000000;
    // b - 1 = 0b00111111;
    //     & = 0
    cout << (b & (b - 1)) << endl;

    // ----------------------------------------------------------
    // 位或运算符 |

    // 1. 设置标记位
    int c = 0b10011;
    //      0b10111;
    cout << bitset<8>((c | 0b00100)) << endl;

    // 2. 置空标记位
    int d = 0b10011;
    //      0b00010; 先或再减(若原位为 1，直接减；若原位为 0，先或变成 1，再减)    
    cout << bitset<8>((d | 0b00010) - 0b00010) << endl;

    // 3. 低位连续 0 变 1
    int e = 0b101000;
    //      0b100111;   位或自身 -1
    cout << bitset<8>(e | (e - 1)) << endl;

    // ----------------------------------------------------------
    // 异或运算符 ^     本质是不带进位的二进制加法

    // 1. 标记位取反
    int f = 0b10111;
    cout << bitset<8>(f ^ 0b00010) << endl;

    // 2. 变量交换
    int g = 18;
    int h = 23;
    cout << g << " " << h << endl;
    g = g ^ h;
    h = g ^ h;
    g = g ^ h;
    cout << g << " " << h << endl;

    // 3. 出现奇次数的树
    cout << (17 ^ 18 ^ 18 ^ 19 ^ 19 ^ 20 ^ 20) << endl;

    // 4. 加密

    // ----------------------------------------------------------
    // 按位取反运算符 ~     本质是不带进位的二进制加法
    int i = 0b10101001;
    cout << bitset<8>(~i) << endl;

    // 1. 补码
    // 0b00000000000000000000000000000000 = 0
    // 0b11111111111111111111111111111111 = -1  (0 - 1)
    // 0b11111111111111111111111111111110 = -2  (-1 - 1)
    // 正数补码是它本身，负数的补码是对应正数取反 +1 (符号位不变)
    int j = 19;
    cout << "原码: " << j << endl;
    cout << "反码: " << (~j) << endl;
    cout << "求相反数: " << (~j + 1) << endl;
    return 0;
}
