#include <iostream>
using namespace std;

/*
    1. 数据结构学习大纲

    概念篇:
        2.1 数据结构概览
            2.1.1 数据结构和算法
            2.1.2 数据结构
            2.1.3 逻辑结构
            2.1.4 存储结构
        2.2 时间复杂度
        2.3 空间复杂度

    课程内容:
        3. 环境使用(HDOJ, POJ, LeetCode)
        线性结构:
        4. 顺序表
            4.1 概念
            4.2 代码
            4.3 实战
                4.3.1 ACM模式(main 函数)
                4.3.2 核心代码模式(实现一个类的函数)
        5. 单向链表
        6. 栈
        7. 队列
        8. 栈 <-> 队列 互转
        9. 串（实质顺序表）
        树形结构:
        10. 树
        11. 二叉树
        12. 二叉搜索树
        图形结构：
        13. 图
        14. 邻接矩阵
        15. 邻接表
        散列结构：
        16. 哈希表 
*/

int main() {


    return 0;
}